waves2foam/task2_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          3000;
        startFace       2350724;
    }
    outlet
    {
        type            patch;
        nFaces          3000;
        startFace       2353724;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9014;
        startFace       2356724;
    }
    atmosphere
    {
        type            patch;
        nFaces          8965;
        startFace       2365738;
    }
    frontAndBack
    {
        type            slip;
        inGroups        1(slip);
        nFaces          30000;
        startFace       2374703;
        faces           ( ( 0 1 5 4 ) ( 4 5 9 8 ) ( 8 9 13 12 ) ( 3 7 6 2 ) ( 7 11 10 6 ) ( 11 15 14 10 ) );
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          18064;
        startFace       2404703;
    }
)

// ************************************************************************* //
